In [34]:
import pandas as pd
import numpy as np

In [35]:
data = np.random.randn(4,3) # 4 rows, 3 columns of random numbers

In [36]:
data

array([[-0.3049182 , -0.1493775 , -0.13253174],
       [ 0.0198316 ,  1.19095101, -2.31582802],
       [ 0.82029915, -1.45767682, -0.06292541],
       [-0.59768043, -0.01891393,  0.56769967]])

In [37]:
dataFrame = pd.DataFrame(data) # excele benzer bir çıktı verir veriden

In [38]:
dataFrame

          0         1         2
0 -0.304918 -0.149377 -0.132532
1  0.019832  1.190951 -2.315828
2  0.820299 -1.457677 -0.062925
3 -0.597680 -0.018914  0.567700

In [39]:
type(dataFrame[0])

pandas.core.series.Series

In [40]:
dataFrame

          0         1         2
0 -0.304918 -0.149377 -0.132532
1  0.019832  1.190951 -2.315828
2  0.820299 -1.457677 -0.062925
3 -0.597680 -0.018914  0.567700

In [41]:
yeniDataFrame = pd.DataFrame(data, index = ["Selim","Atlas","Mehmet","Lale"], columns = ["Maas","Yas","Calisma Saati"]) # (veri, index, columns)

In [42]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Selim  -0.304918 -0.149377      -0.132532
Atlas   0.019832  1.190951      -2.315828
Mehmet  0.820299 -1.457677      -0.062925
Lale   -0.597680 -0.018914       0.567700

In [43]:
yeniDataFrame["Yas"] # sadece yaşları getirir

Selim    -0.149377
Atlas     1.190951
Mehmet   -1.457677
Lale     -0.018914
Name: Yas, dtype: float64

In [44]:
yeniDataFrame[["Maas","Yas"]] # sadece maaş ve yaşları getir sütularda

            Maas       Yas
Selim  -0.304918 -0.149377
Atlas   0.019832  1.190951
Mehmet  0.820299 -1.457677
Lale   -0.597680 -0.018914

In [45]:
yeniDataFrame.loc["Atlas"] # Atlas'ın tüm bilgilerini getirir

Maas             0.019832
Yas              1.190951
Calisma Saati   -2.315828
Name: Atlas, dtype: float64

In [46]:
yeniDataFrame.loc["Selim"] # sütün adına göre değer göster

Maas            -0.304918
Yas             -0.149377
Calisma Saati   -0.132532
Name: Selim, dtype: float64

In [47]:
yeniDataFrame.iloc[0] # index numarasına göre değer göster

Maas            -0.304918
Yas             -0.149377
Calisma Saati   -0.132532
Name: Selim, dtype: float64

In [48]:
yeniDataFrame["Maas"]

Selim    -0.304918
Atlas     0.019832
Mehmet    0.820299
Lale     -0.597680
Name: Maas, dtype: float64

In [49]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"] # yeni bir sütun oluşturduk

In [50]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Selim  -0.304918 -0.149377      -0.132532       -0.298755
Atlas   0.019832  1.190951      -2.315828        2.381902
Mehmet  0.820299 -1.457677      -0.062925       -2.915354
Lale   -0.597680 -0.018914       0.567700       -0.037828

In [51]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1,inplace=False) # sütun silme işlemi inplace = false yaparsak kalıcı olmaz

            Maas       Yas  Calisma Saati
Selim  -0.304918 -0.149377      -0.132532
Atlas   0.019832  1.190951      -2.315828
Mehmet  0.820299 -1.457677      -0.062925
Lale   -0.597680 -0.018914       0.567700

In [52]:
yeniDataFrame.drop("Mehmet", axis = 0, inplace = True) # sütun silme işlemi

In [53]:
yeniDataFrame

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Selim -0.304918 -0.149377      -0.132532       -0.298755
Atlas  0.019832  1.190951      -2.315828        2.381902
Lale  -0.597680 -0.018914       0.567700       -0.037828

In [54]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace = True) # sütun silme işlemi inplace = True ile kalıcı hale getirdik

In [55]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Selim -0.304918 -0.149377      -0.132532
Atlas  0.019832  1.190951      -2.315828
Lale  -0.597680 -0.018914       0.567700

In [56]:
yeniDataFrame.loc["Selim"]["Yas"] # Selim'in yaşını getir

-0.14937749798179165

In [57]:
yeniDataFrame.loc["Atlas"]["Yas"]

1.1909510102118563

In [60]:
booleanFrame= yeniDataFrame<0

In [61]:
booleanFrame

        Maas    Yas  Calisma Saati
Selim   True   True           True
Atlas  False  False           True
Lale    True   True          False

In [62]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Selim -0.304918 -0.149377      -0.132532
Atlas  0.019832  1.190951      -2.315828
Lale  -0.597680 -0.018914       0.567700

In [63]:
yeniDataFrame[booleanFrame] # 0'dan küçük olanları getir

           Maas       Yas  Calisma Saati
Selim -0.304918 -0.149377      -0.132532
Atlas       NaN       NaN      -2.315828
Lale  -0.597680 -0.018914            NaN

In [65]:
yeniDataFrame[yeniDataFrame<0] # 0'dan küçük olanları getir

           Maas       Yas  Calisma Saati
Selim -0.304918 -0.149377      -0.132532
Atlas       NaN       NaN      -2.315828
Lale  -0.597680 -0.018914            NaN

In [68]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]  # Yaşı 0'dan büyük olanları getir

           Maas       Yas  Calisma Saati
Atlas  0.019832  1.190951      -2.315828

In [69]:
yeniDataFrame[yeniDataFrame["Calisma Saati"]>0] # Çalışma saati 0'dan büyük olanları getir

         Maas       Yas  Calisma Saati
Lale -0.59768 -0.018914         0.5677

In [70]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Selim -0.304918 -0.149377      -0.132532
Atlas  0.019832  1.190951      -2.315828
Lale  -0.597680 -0.018914       0.567700

In [71]:
yeniDataFrame.reset_index() # indexleri sıfırlar

   index      Maas       Yas  Calisma Saati
0  Selim -0.304918 -0.149377      -0.132532
1  Atlas  0.019832  1.190951      -2.315828
2   Lale -0.597680 -0.018914       0.567700

In [72]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Selim -0.304918 -0.149377      -0.132532
Atlas  0.019832  1.190951      -2.315828
Lale  -0.597680 -0.018914       0.567700

In [73]:
yeniIndeksListesi = ["A","B","C"]

In [74]:
yeniIndeksListesi

['A', 'B', 'C']

In [83]:
yeniIndeksListesi= ["A","B","C"]

In [84]:
yeniDataFrame["Yeni İndeks"] = yeniIndeksListesi

In [85]:
yeniDataFrame.set_index("Yeni İndeks") # yeni index oluşturduk

                 Maas       Yas  Calisma Saati
Yeni İndeks
A           -0.304918 -0.149377      -0.132532
B            0.019832  1.190951      -2.315828
C           -0.597680 -0.018914       0.567700

In [86]:
yeniDataFrame

           Maas       Yas  Calisma Saati Yeni İndeks
Selim -0.304918 -0.149377      -0.132532           A
Atlas  0.019832  1.190951      -2.315828           B
Lale  -0.597680 -0.018914       0.567700           C

In [87]:
yeniDataFrame.set_index("Yeni İndeks", inplace = True) # yeni index oluşturduk

In [88]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni İndeks
A           -0.304918 -0.149377      -0.132532
B            0.019832  1.190951      -2.315828
C           -0.597680 -0.018914       0.567700

In [89]:
yeniDataFrame.loc["A"]

Maas            -0.304918
Yas             -0.149377
Calisma Saati   -0.132532
Name: A, dtype: float64

In [90]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [91]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [92]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [93]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [94]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks) # multi index oluşturduk

In [95]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [96]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[20,"C"],[9,"D"],[5,"E"],[50,"F"]]

In [97]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [98]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index = birlesmisIndeks, columns = ["Yas","Meslek"])

In [99]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    20      C
South Park Cartman   9      D
           Kenny     5      E
           Kyle     50      F

In [100]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  20      C

In [101]:
cizgiFilmDataFrame.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny     5      E
Kyle     50      F

In [102]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       5
Meslek    E
Name: Kenny, dtype: object

In [103]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"] # index isimlerini değiştirdik

In [104]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    20      C
South Park Cartman   9      D
           Kenny     5      E
           Kyle     50      F